Homework 1:

import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} df = pd.DataFrame(data)

1. Rename column names using function. "First Name" --> "first_name", "Age" --> "age
2. Print the first 3 rows of the DataFrame
3. Find the mean age of the individuals
4. Select and print only the 'Name' and 'City' columns
5. Add a new column 'Salary' with random salary values
6. Display summary statistics of the DataFrame

In [2]:
import pandas as pd

In [32]:
import numpy as np

In [13]:
data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)

In [ ]:
#1
df=df.rename(columns={"First Name": "first_name", "Age": "age"})
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [ ]:
#2
df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [23]:
#3
mean=df['age'].mean()
print(mean)

32.5

In [30]:
#4
df[['first_name', "City"]]

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [41]:
#5
df["Salary"]=np.random.randint(3000, 10000, size=len(df))
df

  first_name  age           City  Salary
0      Alice   25       New York    4645
1        Bob   30  San Francisco    6619
2    Charlie   35    Los Angeles    4124
3      David   40        Chicago    3871

In [44]:
#6
df.describe()

             age      Salary
count   4.000000     4.00000
mean   32.500000  4814.75000
std     6.454972  1245.24867
min    25.000000  3871.00000
25%    28.750000  4060.75000
50%    32.500000  4384.50000
75%    36.250000  5138.50000
max    40.000000  6619.00000

Homework 2:

Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data. Use below table.

1. Month	Sales	Expenses
    Jan	    5000	  3000
    Feb	    6000      3500
    Mar	    7500	  4000
    Apr  	8000	  4500
2. Calculate and display the maximum sales and expenses.
3. Calculate and display the minimum sales and expenses.
4. Calculate and display the average sales and expenses.

In [ ]:
#1
data={'Month': ['Jan', 'Feb', 'Mar', 'Apr'], 'Sales': [5000, 6000, 7500, 8000], 'Expenses': [3000, 3500, 4000, 4500]}
df=pd.DataFrame(data)
df

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [9]:
#2 
print(f"Max_sales: {df['Sales'].max()}")
print(f"Max_expenses: {df['Expenses'].max()}")

Max_sales: 8000
Max_expenses: 4500

In [12]:
#3
print(f"Min_sales: {df['Sales'].min()}")
print(f"Min_expenses: {df['Expenses'].min()}")

Min_sales: 5000
Min_expenses: 3000

In [13]:
#4
print(f"Avg_sales: {df['Sales'].mean()}")
print(f"Avg_expenses: {df['Expenses'].mean()}")

Avg_sales: 6625.0
Avg_expenses: 3750.0

Homework 3:

Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.

Category	January	February	March	April
Rent	    1200	1300	    1400    1500
Utilities	200	    220	        240	    250
Groceries	300	    320	        330	    350
Entertainment 150	160	        170	    180

1. Calculate and display the maximum expense for each category.
2. Calculate and display the minimum expense for each category.
3. Calculate and display the average expense for each category.
In this task, use .set_index method to make Category column as index.

Try this code, learn it and use it in the task.
expenses.set_index('Category')

In [21]:
data={'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'], 'January': [1200, 200, 300, 150], 'February': [1300, 220, 320, 160], 'March': [1400, 240, 330, 170], 'April': [1500, 250, 350, 180]}
expenses=pd.DataFrame(data)
expenses

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180

In [22]:
#1
expenses.set_index('Category').max(axis=1)

Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

In [23]:
#2
expenses.set_index('Category').min(axis=1)

Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

In [24]:
#3
expenses.set_index('Category').mean(axis=1)

Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64